mit41301/MPLAB-PIC12F629-C-HTC/3 - Interrupts/MC_L3-Toggle_LED-count-int-HTC.c
/************************************************************************
*                                                                       *
*   Filename:      MC_L3-Toggle_LED-count-int-HTC.c                     *
*   Date:          9/6/12                                               *
*   File Version:  1.3                                                  *
*                                                                       *
*   Author:        David Meiklejohn                                     *
*   Company:       Gooligum Electronics                                 *
*                                                                       *
*************************************************************************
*                                                                       *
*   Architecture:  Mid-range PIC                                        *
*   Processor:     12F629                                               *
*   Compiler:      MPLAB XC8 v1.00 (Free mode)                          *
*                                                                       *
*************************************************************************
*                                                                       *
*   Files required: none                                                *
*                                                                       *
*************************************************************************
*                                                                       *
*   Description:    Lesson 3, example 3                                 *
*                                                                       *
*   Demonstrates use of Timer0 interrupt to implement                   *
*   counting debounce algorithm                                         *
*                                                                       *
*   Toggles LED when the pushbutton is pressed (high -> low)            *
*                                                                       *
*************************************************************************
*                                                                       *
*   Pin assignments:                                                    *
*       GP1 = indicator LED                                             *
*       GP3 = pushbutton (active low)                                   *
*                                                                       *
************************************************************************/

#include <xc.h>
#include <stdint.h>


/***** CONFIGURATION *****/
// int reset, no code protect, no brownout detect, no watchdog,
// power-up timer enabled, int RC clock
__CONFIG(MCLRE_OFF & CP_OFF & CPD_OFF & BOREN_OFF & WDTE_OFF & 
         PWRTE_OFF & FOSC_INTRCIO);

// Pin assignments
#define sB_LED  sGPIO.GP1           // indicator LED (shadow)
#define BUTTON  GPIObits.GP3        // pushbutton


/***** CONSTANTS *****/
#define MAX_DB_CNT  20/2    // maximum debounce count = debounce period / sample rate
                            //   (20 ms debounce period / 2 ms per sample)


/***** GLOBAL VARIABLES *****/
volatile union {                // shadow copy of GPIO
    uint8_t         port;
    struct {
        unsigned    GP0     : 1;
        unsigned    GP1     : 1;
        unsigned    GP2     : 1;
        unsigned    GP3     : 1;
        unsigned    GP4     : 1;
        unsigned    GP5     : 1;
    };
} sGPIO;

volatile bit    PB_dbstate;     // debounced pushbutton state (1 = released)
volatile bit    PB_change;      // pushbutton state change flag (1 = changed)


/***** MAIN PROGRAM *****/
void main()
{
    //*** Initialisation
    
    // configure port
    GPIO = 0;                       // start with all LEDs off
    sGPIO.port = 0;                 //   update shadow
    TRISIO = ~(1<<1);               // configure GP1 (only) as an output
    
    // configure Timer0
    OPTION_REGbits.T0CS = 0;        // select timer mode
    OPTION_REGbits.PSA = 1;         // no prescaler (assigned to WDT)
                                    // -> increment every 1 us
                                    
    // initialise variables
    PB_dbstate = 1;                 // initial pushbutton state = released
    PB_change = 0;                  // clear pushbutton change flag (no change)
    
    // enable interrupts
    INTCONbits.T0IE = 1;            // enable Timer0 interrupt
    ei();                           // enable global interrupts

                                    
    //*** Main loop
    for (;;)
    {
        // check for debounced button press
        if (PB_change && !PB_dbstate)       // if button state changed and pressed (low)
        {
            sB_LED = ~sB_LED;               //   toggle LED (via shadow register)
            PB_change = 0;                  //   clear button change flag
        }
        
        // continually copy shadow GPIO to port
        GPIO = sGPIO.port; 
            
    }   // repeat forever
}


/***** INTERRUPT SERVICE ROUTINE *****/
void interrupt isr(void)
{
    static uint8_t  cnt_t0 = 0;     // counts timer0 interrupts
    static uint8_t  cnt_db = 0;     // debounce counter
    
    //*** Service Timer0 interrupt
    //
    //  TMR0 overflows every 250 clocks = 250 us
    //
    //  Debounces pushbutton:
    //    samples every 2 ms (every 8th interrupt)
    //    -> PB_dbstate = debounced state
    //       PB_change  = change flag (1 = new debounced state)   
    // 
    //   (only Timer0 interrupts are enabled)
    //   
    TMR0 += 256-250+3;              // add value to Timer0
                                    //   for overflow after 250 counts
    INTCONbits.T0IF = 0;            // clear interrupt flag
    
    // Debounce pushbutton 
    //   use counting algorithm: accept change in state
    //   only if new state is seen a number of times in succession
    
    // sample switch every 2 ms 
    ++cnt_t0;                       // increment interrupt count (every 250 us)
    if (cnt_t0 == 2000/250)         // until 2 ms has elapsed
    {
        cnt_t0 = 0;                 //   reset interrupt count
        
        // compare raw pushbutton with current debounced state
        if (BUTTON == PB_dbstate)   // if raw pushbutton matches current debounce state,
            cnt_db = 0;             //   reset debounce count
        else                        // else raw pushbutton has changed state
        {
            ++cnt_db;                   // increment debounce count
            if (cnt_db == MAX_DB_CNT)   // when max count is reached
            {                               // accept new state as changed:
                PB_dbstate = !PB_dbstate;   //   toggle debounced state
                cnt_db = 0;                 //   reset debounce count
                PB_change = 1;              //   set pushbutton changed flag
                                            //   (polled and cleared in main loop)
            }
        }   
    }
}
